{
  "deck_title": "Calculus I · Limits, Continuity, and Derivatives",
  "topics": [
    {
      "summary_text": "Calculus begins with the study of limits, which describe how a function behaves as its input approaches a certain value. Limits help us deal with cases where functions are not directly defined but still have predictable behavior near specific points."
    },
    {
      "summary_text": "One-sided limits look at the behavior of a function from the left or right. They are written as lim(x→a⁻) f(x) and lim(x→a⁺) f(x). A two-sided limit exists only when these two values are equal, ensuring the function approaches the same value from both sides."
    },
    {
      "summary_text": "Infinite limits occur when a function grows without bound near a point, such as near a vertical asymptote. In contrast, limits at infinity describe how a function behaves as x becomes very large or very small. These ideas help us understand long-term behavior."
    },
    {
      "summary_text": "Continuity describes functions without breaks, jumps, or holes. A function is continuous at a point if it is defined there, the limit exists there, and the function’s value matches that limit. Continuous functions are predictable and smooth across intervals."
    },
    {
      "summary_text": "Discontinuities come in three forms: removable (a hole in the graph), jump (a sudden jump from one value to another), and infinite (vertical asymptotes). Recognizing these helps in graph analysis and in applying calculus tools effectively."
    },
    {
      "summary_text": "The derivative measures instantaneous rate of change. Defined as f'(x) = lim(h→0)[f(x+h) - f(x)]/h, it captures how quickly a function’s output changes as the input changes. This definition is the foundation of differential calculus."
    },
    {
      "summary_text": "Geometrically, the derivative represents the slope of the tangent line at a point on a curve. This slope indicates how steeply the function is increasing or decreasing at that exact position."
    },
    {
      "summary_text": "The power rule is one of the simplest differentiation shortcuts: if f(x) = xⁿ, then f'(x) = n·xⁿ⁻¹. This rule applies to positive, negative, and fractional exponents, greatly simplifying derivative calculations."
    },
    {
      "summary_text": "The product rule is used when differentiating the product of two functions: if f(x) = u(x)·v(x), then f'(x) = u'(x)·v(x) + u(x)·v'(x). This ensures both functions’ changes are accounted for."
    },
    {
      "summary_text": "The quotient rule handles division of functions: if f(x) = u(x)/v(x), then f'(x) = [u'(x)·v(x) - u(x)·v'(x)] / [v(x)]². It is essential when functions are expressed as ratios."
    },
    {
      "summary_text": "The chain rule allows differentiation of composite functions: if f(x) = g(h(x)), then f'(x) = g'(h(x))·h'(x). This rule is critical for functions nested within other functions, such as trigonometric and exponential compositions."
    },
    {
      "summary_text": "Derivatives of trigonometric functions are foundational: d/dx(sin x) = cos x, d/dx(cos x) = -sin x, and d/dx(tan x) = sec²x. Knowing these builds toward handling more complex problems involving trig functions."
    },
    {
      "summary_text": "Inverse trigonometric functions also have derivatives, such as d/dx(arcsin x) = 1/√(1 - x²). These results are useful in calculus applications like integration and solving differential equations."
    },
    {
      "summary_text": "Exponential and logarithmic functions differentiate cleanly: d/dx(eˣ) = eˣ, and d/dx(ln x) = 1/x. These simple results make them key tools in calculus and applied problems."
    }
  ]
}
